import stanza
import re

# Завантаження моделей (один раз)
stanza.download('uk')
stanza.download('ru')

# Ініціалізація пайплайнів
nlp_uk = stanza.Pipeline(lang='uk', processors='tokenize,mwt,pos,lemma')
nlp_ru = stanza.Pipeline(lang='ru', processors='tokenize,pos,lemma')


# Нормалізація тексту
def normalize_text(text: str) -> list[str]:
    cleaned_text = re.sub(r"[^\w\s]", "", text.lower())

    # Обробка тексту обома мовами
    doc_uk = nlp_uk(cleaned_text)
    doc_ru = nlp_ru(cleaned_text)

    normalized = set()  # Використовуємо set для уникнення дублювання

    # Лемматизація для української мови
    for sentence in doc_uk.sentences:
        for word in sentence.words:
            normalized.add(word.lemma)

    # Лемматизація для російської мови
    for sentence in doc_ru.sentences:
        for word in sentence.words:
            normalized.add(word.lemma)
    print(list(normalized))
    return list(normalized)  # Повертаємо список з унікальними лемами


normalize_text("лс, чистий, пасив, людина, новий, проєкт, цифрова, валюта, хотіти, гідно, заробляти, хороший, додатковий, дохід, учитель, англійський, віддалений, діяльність, співробітництво, сфера, формат, збільшення, капітал, вимагатися, співробітник, тестування, мережа, партнер, стартувати, перспектива, заняття, ставка, спорт, стабільний, щоденно, терміново, слот, гра, зв’язатися, деталь, особистий, повідомлення, графік, зайнятість, гнучкий, рубль, реєстрація, розповісти, подробиця, робота, високий, місце, простий, дія, телефон, запрошувати, прибутковий, пропозиція, справа, короткий, термін, прибуток, онлайн, пропонувати, потік, новачок, постійний, фінансовий, отримати, шукати, фото, контакт, плюс, писати, дізнатися, директ, проект, легкий, щоденний, пасивний, партнер, команда, парсинг, приємний, повідомлення, набір, рік, навчання, індивідуальний, партнерство, ризик, інвестиція, інтим, дохід, без, межа, платити, зацікавити, набирати, команда, потрібний, відповідальний, новий, вид, низький, шанс, наркотик, команда, нацизм, дитячий, порно, гроші, гарантія, заробіток, вигідний, курс, умова, питання, платформа, взаємовигідний, вакансія, доступний, ціна, безкоштовний, амазон, убер, онлайн, звертатися, директ, активний, цікаво, тема, квартира, будівельний, об’єкт, водійський, право, розстрочка, смартфон, партнерство, кандидат, напрямок, пропонувати, формат")





