from const import *  # Ти можеш додати заборонені фрази сюди
import re
from datetime import datetime
# Список заборонених фраз
forbidden_phrases = [
    "Ежедневный доход", "достойный заработок", "пассивного дохода", "набор в команду", "Все условия в ЛС пиши +",
    "сотрудничества на удалёнке", "хороший доп. доход", "еженедельная прибыль", "И н т и м. Ф О Т 0",
    "онлайн заработок", "люди", "удалённая занятость", "удалённого сотрудничества", "Белая темка", "Пишите плюс в ЛС",
    "удалённый заработок", "легкий пассивный доход", "Нужны Люди", "Пишите + в Личные", "поиске людей", "Идёт набор",
    "ежедневная прибыль", "чистом пассиве", "выгодные условия", "несложная занятость", "Гибкий график", "Открыт набор",
    "партнеров команду", "капиталом", "удаленную деятельность", "перспективный проект", "УДАЛЕННАЯ ЗАНЯТОСТЬ",
    "заработка", "Прибыльное предложение", "взаимовыгодного сотрудничества", "Набираю команду", "Прибыльное предложение",
    "прибыльный вариант", "Нужны заинтересованные", "заработок в онлайн формате", "вариант дохода", "прибыли онлайн",
    "слоты и игры", "дополнительный заработок", "обмен валют", "арбитраж", "дополнительный", "выгодный курс", "выгодный курс",
    "удаленка", "заработок", "заработок", "валюта", "ОБМЕН ВАЛЮТ", "ЗАРАБОТОК", "ЗАРАБОТОК", "УДАЛЕНКА", "ВЫГОДНЫЙ КУРС",
    "ВЫГОДНЫЙ КУРС", "Учитель английского", "вакансия", "ВАКАНСИЯ", "ИНТИМ", "интим", "набор в команду", "тестирование сети",
    "Старт занятий", "крипто", "делаем это быстро и с гарантией", "для расширения команды", "нужны люди", "обучаем без проблем",
    "ВТБ решил порадовать", "поток новичков", "новый вид заработка", "цифровая валюта", "Предлагаю работу", "партнеры из TG",
    "Онлайн Борк", "выплата каждый день", "пассивном доходе", "КУРС НА СЕГОДНЯ", "Dypдаш u takcu", "Низкая цена", "Гарантия - 1 месяц",
    "Рассрочка", "Без предоплаты", "нацизм", "дитяче порно", "интим", "Есть подработка в", "Заплачу тебе за", "места на УДАЛЕНКУ",
    "Пишите в ЛС", "Пишите + в ЛС", "Ищy eдиномышленникoв для", "Требуются сотрудники для", "Популярные слоты", "ставки на спорт",
    "+ в лс", "Пишите в л.с.", "Интересуетесь доходом", "into my DM", "Ищем команду для", "удаленного заработка", "Обучим всему с нуля",
    "Пиши в ЛС", "партнёров в команду", "Пиши «+» в личные сообщения", "Количество мест ограничено", "Выиграл 55к", "Ищем сотрудника",
    "Пиши + в ЛС", "с гибким графиком", "Ищу 2 людей в команду", "От 100$ в день", "получить подробности", "Хочешь достойно зарабатывать",
    "высокий доход в", "пишите " + " в личные сообщения", "В поиске людей, кому нужна подработка", "oнлaйн-paбoты",
    "Вoзмoжнoсть зaraбaтывaть", "пишитe нa ocнoвнoй aккaунт", "Тpeбуются пapтнepы"
]


# Функція для перевірки на заборонені слова
def contains_forbidden_word(message_text):
    for word in forbidden_phrases:
        if word in message_text.lower():
            return True
    return False

# Основна функція для обробки повідомлень
def process_messages():
    messages = Message.objects.all()  # Отримуємо всі повідомлення
    for message in messages:
        # Перевіряємо повідомлення на наявність заборонених слів
        if contains_forbidden_word(message.message_text):
            action = 'deleted'  # Якщо заборонене слово - повідомлення видаляється або позначається
        else:
            action = None

        # Якщо є заборонене слово, скидаємо лічильник для користувача
        if action == 'deleted':
            try:
                user_message_count = UserMessageCount.objects.get(user_id=message.user_id, chats_names=message.chats_names)
                user_message_count.message_count = 0  # Скидаємо лічильник повідомлень
                user_message_count.save()
            except UserMessageCount.DoesNotExist:
                # Якщо користувач не знайдений, створюємо новий запис з нульовим лічильником
                if message.user_id:  # Перевіряємо, чи є user_id
                    UserMessageCount.objects.create(
                        user_id=message.user_id,
                        chats_names=message.chats_names,
                        message_count=0,
                        name=message.first_name or 'No Name'
                    )
                else:
                    print(f"User ID для повідомлення {message.id} відсутній.")

        # Якщо повідомлення не містить заборонених слів, нараховуємо лічильник
        if action is None:
            if message.user_id:  # Перевіряємо, чи є user_id
                user_message_count, created = UserMessageCount.objects.get_or_create(
                    user_id=message.user_id, chats_names=message.chats_names
                )
                user_message_count.message_count += 1  # Збільшуємо лічильник повідомлень
                user_message_count.save()
            else:
                print(f"User ID для повідомлення {message.id} відсутній.")

        # Зберігаємо або оновлюємо повідомлення
        message.action = action
        message.save()

# Викликаємо функцію для обробки повідомлень
if __name__ == "__main__":
    process_messages()

